diffusor-mesh/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
LsO 0.64278761;
ULcO 2.71604444;
DLcO 2.76604444;
TLcO 3.76604444;

z1  0.0; 
z2  0.1; 
Nup   80;
Nuu   40;
Ncowl 20;
Naxis 150;
Ninf  200;
Nramp 200;
Ndown 100;

convertToMeters 1;

vertices
(
	(1.0	0.0		$z1) // Point 0
	(2.0	0.0		$z1) // Point 1
	($DLcO	$LsO	$z1) // Point 2
	($TLcO	0.1		$z1) // Point 3
	(1.0	0.8		$z1) // Point 4
	(2.0	0.8		$z1) // Point 5
	($DLcO	0.8		$z1) // Point 6
	($TLcO	0.8		$z1) // Point 7
	(1.0	0.85	$z1) // Point 8
	(2.0	0.85	$z1) // Point 9
	($ULcO	0.85	$z1) // Point 10
	($TLcO	0.85	$z1) // Point 11
	(1.0	1.85	$z1) // Point 12
	(2.0	1.85	$z1) // Point 13
	($ULcO	1.85	$z1) // Point 14
	($TLcO	1.85	$z1) // Point 15

	(1.0	0.0		$z2) // Point 16
	(2.0	0.0		$z2) // Point 17
	($DLcO	$LsO	$z2) // Point 18
	($TLcO	0.1		$z2) // Point 19
	(1.0	0.8		$z2) // Point 20
	(2.0	0.8		$z2) // Point 21
	($DLcO	0.8		$z2) // Point 22
	($TLcO	0.8		$z2) // Point 23
	(1.0	0.85	$z2) // Point 24
	(2.0	0.85	$z2) // Point 25
	($ULcO	0.85	$z2) // Point 26
	($TLcO	0.85	$z2) // Point 27
	(1.0	1.85	$z2) // Point 28
	(2.0	1.85	$z2) // Point 29
	($ULcO	1.85	$z2) // Point 30
	($TLcO	1.85	$z2) // Point 31
);

blocks
(
	//block 0
    hex (0 1 5 4 16 17 21 20) ($Ninf $Naxis 1) simpleGrading
    (
    	0.1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )    
    //block 1
    hex (1 2 6 5 17 18 22 21) ($Nramp $Naxis 1) simpleGrading
    (
    	1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 2
    hex (2 3 7 6 18 19 23 22) ($Ndown $Naxis 1) simpleGrading 		
    (
    	10
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 3
    hex (4 5 9 8 20 21 25 24) ($Ninf $Ncowl 1) simpleGrading (0.1 1 1)
    //block 4
    hex (5 6 10 9 21 22 26 25) ($Nramp $Ncowl 1) simpleGrading (1 1 1)
    //block 5
    hex (8 9 13 12 24 25 29 28) ($Ninf $Nup 1) simpleGrading (0.1 15 1)
    //block 6
    hex (9 10 14 13 25 26 30 29) ($Nramp $Nup 1) simpleGrading (1 15 1)
    //block 7
    hex (10 11 15 14 26 27 31 30) ($Nuu $Nup 1) simpleGrading (10 15 1)
);

edges
(    spline 2 3 ( 
        (2.76604444 0.64278761 0.0) 
        (2.77614545 0.63947584 0.0) 
        (2.78624646 0.63611976 0.0) 
        (2.79634747 0.63271937 0.0) 
        (2.80644848 0.62927468 0.0) 
        (2.81654949 0.62578569 0.0) 
        (2.82665050 0.62225239 0.0) 
        (2.83675151 0.61867479 0.0) 
        (2.84685252 0.61505289 0.0) 
        (2.85695353 0.61138667 0.0) 
        (2.86705454 0.60767616 0.0) 
        (2.87715555 0.60392134 0.0) 
        (2.88725656 0.60012221 0.0) 
        (2.89735757 0.59627878 0.0) 
        (2.90745858 0.59239105 0.0) 
        (2.91755959 0.58845901 0.0) 
        (2.92766060 0.58448266 0.0) 
        (2.93776161 0.58046201 0.0) 
        (2.94786262 0.57639706 0.0) 
        (2.95796364 0.57228780 0.0) 
        (2.96806465 0.56813424 0.0) 
        (2.97816566 0.56393637 0.0) 
        (2.98826667 0.55969420 0.0) 
        (2.99836768 0.55540772 0.0) 
        (3.00846869 0.55107694 0.0) 
        (3.01856970 0.54670185 0.0) 
        (3.02867071 0.54228246 0.0) 
        (3.03877172 0.53781877 0.0) 
        (3.04887273 0.53331077 0.0) 
        (3.05897374 0.52875846 0.0) 
        (3.06907475 0.52416185 0.0) 
        (3.07917576 0.51952094 0.0) 
        (3.08927677 0.51483572 0.0) 
        (3.09937778 0.51010619 0.0) 
        (3.10947879 0.50533237 0.0) 
        (3.11957980 0.50051423 0.0) 
        (3.12968081 0.49565179 0.0) 
        (3.13978182 0.49074505 0.0) 
        (3.14988283 0.48579401 0.0) 
        (3.15998384 0.48079865 0.0) 
        (3.17008485 0.47575900 0.0) 
        (3.18018586 0.47067504 0.0) 
        (3.19028687 0.46554677 0.0) 
        (3.20038788 0.46037420 0.0) 
        (3.21048889 0.45515732 0.0) 
        (3.22058990 0.44989615 0.0) 
        (3.23069091 0.44459066 0.0) 
        (3.24079192 0.43924087 0.0) 
        (3.25089293 0.43384678 0.0) 
        (3.26099394 0.42840838 0.0) 
        (3.27109495 0.42292568 0.0) 
        (3.28119596 0.41739867 0.0) 
        (3.29129697 0.41182736 0.0) 
        (3.30139798 0.40621174 0.0) 
        (3.31149899 0.40055182 0.0) 
        (3.32160000 0.39484759 0.0) 
        (3.33170101 0.38909906 0.0) 
        (3.34180202 0.38330622 0.0) 
        (3.35190303 0.37746908 0.0) 
        (3.36200404 0.37158764 0.0) 
        (3.37210505 0.36566189 0.0) 
        (3.38220606 0.35969183 0.0) 
        (3.39230707 0.35367747 0.0) 
        (3.40240808 0.34761881 0.0) 
        (3.41250909 0.34151584 0.0) 
        (3.42261010 0.33536857 0.0) 
        (3.43271111 0.32917699 0.0) 
        (3.44281212 0.32294111 0.0) 
        (3.45291313 0.31666092 0.0) 
        (3.46301414 0.31033643 0.0) 
        (3.47311515 0.30396763 0.0) 
        (3.48321616 0.29755453 0.0) 
        (3.49331717 0.29109713 0.0) 
        (3.50341818 0.28459541 0.0) 
        (3.51351919 0.27804940 0.0) 
        (3.52362020 0.27145908 0.0) 
        (3.53372121 0.26482446 0.0) 
        (3.54382222 0.25814553 0.0) 
        (3.55392323 0.25142229 0.0) 
        (3.56402424 0.24465475 0.0) 
        (3.57412525 0.23784291 0.0) 
        (3.58422626 0.23098676 0.0) 
        (3.59432727 0.22408631 0.0) 
        (3.60442828 0.21714155 0.0) 
        (3.61452929 0.21015249 0.0) 
        (3.62463030 0.20311912 0.0) 
        (3.63473131 0.19604145 0.0) 
        (3.64483232 0.18891948 0.0) 
        (3.65493333 0.18175320 0.0) 
        (3.66503434 0.17454261 0.0) 
        (3.67513535 0.16728772 0.0) 
        (3.68523636 0.15998853 0.0) 
        (3.69533737 0.15264503 0.0) 
        (3.70543838 0.14525722 0.0) 
        (3.71553939 0.13782511 0.0) 
        (3.72564040 0.13034870 0.0) 
        (3.73574141 0.12282798 0.0) 
        (3.74584242 0.11526296 0.0) 
        (3.75594343 0.10765363 0.0) 
        (3.76604444 0.10000000 0.0) 
        ) 
    spline 18 19 ( 
        (2.76604444 0.64278761 0.1) 
        (2.77614545 0.63947584 0.1) 
        (2.78624646 0.63611976 0.1) 
        (2.79634747 0.63271937 0.1) 
        (2.80644848 0.62927468 0.1) 
        (2.81654949 0.62578569 0.1) 
        (2.82665050 0.62225239 0.1) 
        (2.83675151 0.61867479 0.1) 
        (2.84685252 0.61505289 0.1) 
        (2.85695353 0.61138667 0.1) 
        (2.86705454 0.60767616 0.1) 
        (2.87715555 0.60392134 0.1) 
        (2.88725656 0.60012221 0.1) 
        (2.89735757 0.59627878 0.1) 
        (2.90745858 0.59239105 0.1) 
        (2.91755959 0.58845901 0.1) 
        (2.92766060 0.58448266 0.1) 
        (2.93776161 0.58046201 0.1) 
        (2.94786262 0.57639706 0.1) 
        (2.95796364 0.57228780 0.1) 
        (2.96806465 0.56813424 0.1) 
        (2.97816566 0.56393637 0.1) 
        (2.98826667 0.55969420 0.1) 
        (2.99836768 0.55540772 0.1) 
        (3.00846869 0.55107694 0.1) 
        (3.01856970 0.54670185 0.1) 
        (3.02867071 0.54228246 0.1) 
        (3.03877172 0.53781877 0.1) 
        (3.04887273 0.53331077 0.1) 
        (3.05897374 0.52875846 0.1) 
        (3.06907475 0.52416185 0.1) 
        (3.07917576 0.51952094 0.1) 
        (3.08927677 0.51483572 0.1) 
        (3.09937778 0.51010619 0.1) 
        (3.10947879 0.50533237 0.1) 
        (3.11957980 0.50051423 0.1) 
        (3.12968081 0.49565179 0.1) 
        (3.13978182 0.49074505 0.1) 
        (3.14988283 0.48579401 0.1) 
        (3.15998384 0.48079865 0.1) 
        (3.17008485 0.47575900 0.1) 
        (3.18018586 0.47067504 0.1) 
        (3.19028687 0.46554677 0.1) 
        (3.20038788 0.46037420 0.1) 
        (3.21048889 0.45515732 0.1) 
        (3.22058990 0.44989615 0.1) 
        (3.23069091 0.44459066 0.1) 
        (3.24079192 0.43924087 0.1) 
        (3.25089293 0.43384678 0.1) 
        (3.26099394 0.42840838 0.1) 
        (3.27109495 0.42292568 0.1) 
        (3.28119596 0.41739867 0.1) 
        (3.29129697 0.41182736 0.1) 
        (3.30139798 0.40621174 0.1) 
        (3.31149899 0.40055182 0.1) 
        (3.32160000 0.39484759 0.1) 
        (3.33170101 0.38909906 0.1) 
        (3.34180202 0.38330622 0.1) 
        (3.35190303 0.37746908 0.1) 
        (3.36200404 0.37158764 0.1) 
        (3.37210505 0.36566189 0.1) 
        (3.38220606 0.35969183 0.1) 
        (3.39230707 0.35367747 0.1) 
        (3.40240808 0.34761881 0.1) 
        (3.41250909 0.34151584 0.1) 
        (3.42261010 0.33536857 0.1) 
        (3.43271111 0.32917699 0.1) 
        (3.44281212 0.32294111 0.1) 
        (3.45291313 0.31666092 0.1) 
        (3.46301414 0.31033643 0.1) 
        (3.47311515 0.30396763 0.1) 
        (3.48321616 0.29755453 0.1) 
        (3.49331717 0.29109713 0.1) 
        (3.50341818 0.28459541 0.1) 
        (3.51351919 0.27804940 0.1) 
        (3.52362020 0.27145908 0.1) 
        (3.53372121 0.26482446 0.1) 
        (3.54382222 0.25814553 0.1) 
        (3.55392323 0.25142229 0.1) 
        (3.56402424 0.24465475 0.1) 
        (3.57412525 0.23784291 0.1) 
        (3.58422626 0.23098676 0.1) 
        (3.59432727 0.22408631 0.1) 
        (3.60442828 0.21714155 0.1) 
        (3.61452929 0.21015249 0.1) 
        (3.62463030 0.20311912 0.1) 
        (3.63473131 0.19604145 0.1) 
        (3.64483232 0.18891948 0.1) 
        (3.65493333 0.18175320 0.1) 
        (3.66503434 0.17454261 0.1) 
        (3.67513535 0.16728772 0.1) 
        (3.68523636 0.15998853 0.1) 
        (3.69533737 0.15264503 0.1) 
        (3.70543838 0.14525722 0.1) 
        (3.71553939 0.13782511 0.1) 
        (3.72564040 0.13034870 0.1) 
        (3.73574141 0.12282798 0.1) 
        (3.74584242 0.11526296 0.1) 
        (3.75594343 0.10765363 0.1) 
        (3.76604444 0.10000000 0.1) 
        ) 

);

boundary
(
	inlet
    {
        type patch;
        faces
        (
            (12 28 24 8)
            (8 24 20 4)
            (4 20 16 0)
        );
    }   

	outlet
    {
        type patch;
        faces
        (
            (31 15 11 27)
        );
    }   

	compressor
    {
        type patch;
        faces
        (
            (23 7 3 19)
        );
    }   

	upper
    {
        type patch;
        faces
        (
            (28 12 13 29)
            (29 13 14 30)
            (30 14 15 31)
        );
    }   

	lower
    {
        type patch;
        faces
        (
            (0 16 17 1)
        );
    }   
    
	cowl
    {
        type patch;
        faces
        (
            (10 26 27 11)
            (26 10 6 22)
            (22 6 7 23)
        );
    }   

	axis
    {
        type patch;
        faces
        (
            (18 2 1 17)
            (19 3 2 18)
        );
    }   
);

// ************************************************************************* //
